tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "rcmdnk/file"
brew "ack"
brew "anyenv"
brew "deno"
brew "ghq"
brew "gibo"
brew "git"
brew "highlight"
brew "hub"
brew "jq"
brew "mas"
brew "nkf"
brew "peco"
brew "pipenv"
brew "python@2", link: false
brew "python@3.8"
brew "ruby-build"
brew "tig"
brew "tmux"
brew "tree"
brew "yarn"
brew "zsh"
cask "julia"
cask "kap"
cask "keycastr"
mas "CotEditor", id: 1024640650
mas "Day One", id: 1055511498
mas "Focus", id: 777233759
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835
