cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'rcmdnk/file'
tap 'sanemat/font'
brew 'libyaml'
brew 'openssl'
brew 'ansible'
brew 'aspell', args: ['with-all-langs']
brew 'autoconf'
brew 'autojump'
brew 'xz'
brew 'automake'
brew 'icu4c'
brew 'boost'
brew 'brew-gem'
brew 'pkg-config'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'pixman'
brew 'gettext'
brew 'libffi'
brew 'glib'
brew 'cairo'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'libsodium'
brew 'zeromq'
brew 'czmq'
brew 'libtool'
brew 'gobject-introspection'
brew 'harfbuzz'
brew 'pango'
brew 'jpeg'
brew 'libtiff'
brew 'fontforge'
brew 'gawk'
brew 'gdbm'
brew 'gibo'
brew 'gnu-sed', args: ['with-default-names']
brew 'hub'
brew 'imagemagick'
brew 'libevent'
brew 'lua'
brew 'lv'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'macvim', args: ['with-lua', 'with-cscope' 'with-lua' 'override-system-vim' 'with-luajit' 'with-python3' 'HEAD']
brew 'mecab'
brew 'mecab-ipadic'
brew 'mercurial'
brew 'mysql'
brew 'nkf'
brew 'nodebrew'
brew 'pcre'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ruby-build'
brew 'rbenv'
brew 'the_platinum_searcher'
brew 'tidy-html5'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['with-lua', 'HEAD']
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'homebrew/boneyard/pyenv-pip-rehash'
brew 'homebrew/dupes/groff'
brew 'neovim/neovim/neovim', args: ['HEAD']
brew 'rcmdnk/file/brew-file'
brew 'reattach-to-user-namespace'
brew 'ghq'
brew 'hub'
brew 'peco'

cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'slack'
